---
kind: method
id: M:Autodesk.Revit.Exceptions.CheckoutElementsRequestTooLargeException.GetObjectData(System.Runtime.Serialization.SerializationInfo,System.Runtime.Serialization.StreamingContext)
source: html/b9afd0aa-1692-4522-5ce4-ad99704d258c.htm
---
# Autodesk.Revit.Exceptions.CheckoutElementsRequestTooLargeException.GetObjectData Method

Retrieves data needed to serialize the target object.

## Syntax (C#)
```csharp
public override void GetObjectData(
	SerializationInfo info,
	StreamingContext context
)
```

## Parameters
- **info** (`System.Runtime.Serialization.SerializationInfo`) - Data needed to serialize or deserialize the object.
- **context** (`System.Runtime.Serialization.StreamingContext`) - The destination of the serialized stream.